# Introduction to Pandas

[Pandas](https://pandas.pydata.org/) is a library written on top of [Python](https://www.python.org/) and provides powerful and flexible functionalities to help us manipulate and analyze data.
![](images/step-ml-framework-tools-highlight.png)

## Import Pandas (and other libraries)

In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import sklearn as sk

## `Data Series` and `Data Frame`

There are two basic data types in `Pandas` - `Series` and `DataFrame`.
* `Series` - a 1-dimensional column of data
* `DataFrame` - (most common) a 2-dimensional table of data with rows and columns

In [2]:
# Define a Series
items = pd.Series(['Book', 'Computer', 'Food'])
items

0        Book
1    Computer
2        Food
dtype: object

In [3]:
# Another Series
price = pd.Series([10, 1500, 20])
price

0      10
1    1500
2      20
dtype: int64

In [4]:
# Define a DataFrame by passing in a `Python Dictionary` with keys are column names (heading) and values are associated Series
shopping_cart = pd.DataFrame({
    'Items': items,
    'Price': price
})
shopping_cart

      Items  Price
0      Book     10
1  Computer   1500
2      Food     20

## Use Pandas to read CSV data from file

In [5]:
car_sales = pd.read_csv('data/car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe `data frame` created from Pandas's `read_csv` method

In [6]:
# dtypes shows data type of each column
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [7]:
# info() method gives number of entries (rows), columns with their name, non-nul count and data type
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [8]:
# Show the length (number of rows/records) of a data frame without counting the heading as 1 row.
# This means it only counts the number of data rows (from the second line).
len(car_sales)

10

In [9]:
# Describe the data frame will only show information about numeric columns
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

## Select specific `columns` from a `data frame`

In [10]:
# Show a list of columns
columns = car_sales.columns
columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [11]:
# Get the name of the 1st column
columns[0]

'Make'

In [12]:
# Select data from a column
car_makers = car_sales.Make
car_makers

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [13]:
# Select data from a column whose name contains special characters (i.e., space, brackets, ...)
car_odometer = car_sales['Odometer (KM)']
car_odometer

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [14]:
# Form a new data frame by selecting and combining columns from a given data frame
c_makers = car_sales.Make
c_colors = car_sales.Colour
new_car_df = pd.DataFrame({
    'Makers': pd.Series(c_makers),
    'Colors': pd.Series(c_colors)  
})
new_car_df

   Makers Colors
0  Toyota  White
1   Honda    Red
2  Toyota   Blue
3     BMW  Black
4  Nissan  White
5  Toyota  Green
6   Honda   Blue
7   Honda   Blue
8  Toyota  White
9  Nissan  White

## Select specific `rows` from a `DataFrame` or `Series`

In [15]:
# Select first 5 rows using head() method
car_sales_df_header = car_sales.head()
car_sales_df_header

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [16]:
# Select first `n` rows using head(n)
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [17]:
# Select last 5 rows using tail() method
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [18]:
# Select last `n` rows using `tail(n)`
car_sales.tail(2)

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [19]:
# Select a row at position 3 (index 2)
car_sales.iloc[2]

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

In [20]:
# Slicing rows - extract a list of consecutive rows from a dataframe
# ilock[start:end(excluded):step]
car_sales.iloc[2:5]

     Make Colour  Odometer (KM)  Doors       Price
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [21]:
# Extract data in rows `r1` to `r2` (excluded) and columns `c1` to `c2` (excluded)
# iloc[r1:r2, c1:c2]
car_sales.iloc[2:5, 3:5]

   Doors       Price
2      3   $7,000.00
3      5  $22,000.00
4      4   $3,500.00

## Select `columns` or `rows` based on conditions

In [22]:
# Select all rows where a column value satisfies a condition
car_sales[car_sales['Make'] == 'Toyota']

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [23]:
# When combining multiple conditional statements, each condition must be surrounded by parentheses `()`.
# Moreover, you can not use `or`/`and` but need to use the `or` operator `|` and the `and` operator `&`.
car_sales[(car_sales['Make'] == 'Toyota') & (car_sales['Odometer (KM)'] >= 90000)]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
5  Toyota  Green          99213      4  $4,500.00

## Crostab

In [24]:
# pd.crosstab() is a great way to view two different columns together and compare them.
pd.crosstab(car_sales['Colour'], car_sales['Make'] )

Make    BMW  Honda  Nissan  Toyota
Colour
Black     1      0       0       0
Blue      0      2       0       1
Green     0      0       0       1
Red       0      1       0       0
White     0      0       2       2

In [25]:
# If you want to compare more columns in the context of another column, you can use .groupby()
car_sales.groupby(['Make']).count()

        Colour  Odometer (KM)  Doors  Price
Make
BMW          1              1      1      1
Honda        3              3      3      3
Nissan       2              2      2      2
Toyota       4              4      4      4

In [26]:
car_sales.groupby(['Make']).boxplot()

BMW            AxesSubplot(0.1,0.559091;0.363636x0.340909)
Honda     AxesSubplot(0.536364,0.559091;0.363636x0.340909)
Nissan             AxesSubplot(0.1,0.15;0.363636x0.340909)
Toyota        AxesSubplot(0.536364,0.15;0.363636x0.340909)
dtype: object

In [27]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00